DavidSAlexander/STM32RomWebFlasher/STM32RomWebFlasher/src/STM32WebPages.cpp
/********************************************************************************************************
 *  [FILE NAME]   :      <STM32WebPages.cpp>                                                            *
 *  [AUTHOR]      :      <David S. Alexander>                                                           *
 *  [DATE CREATED]:      <Dec 10, 2025>                                                                 *
 *  [Description] :      <Source file for STM32 Web Pages>                                              *
 ********************************************************************************************************/


#include "STM32WebPages.h"

const char LOGIN_HTML_A[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>STM32 Bootloader Login</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<style>
:root {
	--primary: #2c3e50;
	--secondary: #3498db;
	--accent: #2ecc71;
	--danger: #e74c3c;
	--light: #ecf0f1;
	--card-bg: #ffffff;
	--shadow: rgba(0, 0, 0, 0.12);
}

* {
	margin: 0;
	padding: 0;
	box-sizing: border-box;
}

body {
	font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
	background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
	min-height: 100vh;
	display: flex;
	align-items: center;
	justify-content: center;
	padding: 20px;
	color: #333;
}

.login-card {
	background: var(--card-bg);
	border-radius: 16px;
	padding: 30px 28px;
	max-width: 380px;
	width: 100%;
	box-shadow: 0 14px 40px var(--shadow);
}

.login-header {
	text-align: center;
	margin-bottom: 20px;
}

.login-header h1 {
	font-size: 22px;
	color: var(--primary);
	margin-bottom: 6px;
	display: flex;
	align-items: center;
	justify-content: center;
	gap: 8px;
}

.login-header p {
	font-size: 13px;
	color: #777;
}

.login-header i {
	color: var(--secondary);
}

.field-group {
	margin-bottom: 15px;
}

label {
	display: block;
	font-size: 13px;
	color: #555;
	margin-bottom: 5px;
	font-weight: 600;
}

input[type="text"],
input[type="password"] {
	width: 100%;
	padding: 10px 12px;
	border-radius: 8px;
	border: 1px solid #ccc;
	font-size: 14px;
	outline: none;
	transition: border 0.2s ease, box-shadow 0.2s ease;
}

input[type="text"]:focus,
input[type="password"]:focus {
	border-color: var(--secondary);
	box-shadow: 0 0 0 2px rgba(52, 152, 219, 0.15);
}

.btn {
	width: 100%;
	padding: 11px 16px;
	border-radius: 10px;
	border: none;
	font-size: 14px;
	font-weight: 600;
	cursor: pointer;
	display: inline-flex;
	align-items: center;
	justify-content: center;
	gap: 8px;
	color: #fff;
	background: var(--secondary);
	transition: background 0.2s, transform 0.15s, box-shadow 0.15s;
}

.btn:hover {
	background: #2980b9;
	transform: translateY(-1px);
	box-shadow: 0 7px 18px rgba(52, 152, 219, 0.3);
}

.btn:disabled {
	opacity: 0.65;
	cursor: not-allowed;
	box-shadow: none;
	transform: none;
}

.status {
	margin-top: 10px;
	font-size: 13px;
	min-height: 18px;
	text-align: center;
}

.status.ok {
	color: var(--accent);
}

.status.err {
	color: var(--danger);
}

.footer {
	margin-top: 16px;
	font-size: 11px;
	text-align: center;
	color: #999;
}

.footer code {
	background: #f4f5f7;
	padding: 2px 4px;
	border-radius: 4px;
	font-size: 11px;
}
</style>
</head>
<body>
<div class="login-card">
<div class="login-header">
<h1><i class="fas fa-microchip"></i> STM32 Bootloader</h1>
<p>Sign in to access the FOTA control panel</p>
</div>

<form id="loginForm">
<div class="field-group">
<label for="user">Username</label>
<input type="text" id="user" name="user" autocomplete="username" required>
</div>

<div class="field-group">
<label for="pass">Password</label>
<input type="password" id="pass" name="pass" autocomplete="current-password" required>
</div>

<button type="submit" id="loginBtn" class="btn">
<i class="fas fa-sign-in-alt"></i> Login
</button>
</form>

<div id="statusMsg" class="status"></div>

<div class="footer">
<p>Device host: <code>http://)rawliteral";

const char LOGIN_HTML_B[] PROGMEM = R"rawliteral(.local/</code></p>
<p>By David S. Alexander</p>
</div>
</div>

<script>
const form = document.getElementById('loginForm');
const btn  = document.getElementById('loginBtn');
const msg  = document.getElementById('statusMsg');

form.addEventListener('submit', async (e) => {
	e.preventDefault();
	msg.textContent = '';
	msg.className = 'status';

	const u = document.getElementById('user').value.trim();
	const p = document.getElementById('pass').value;

	if (!u || !p) {
		msg.textContent = 'Please enter username and password.';
		msg.classList.add('err');
		return;
	}

	btn.disabled = true;
	const originalHtml = btn.innerHTML;
	btn.innerHTML = '<i class="fas fa-spinner fa-spin"></i> Checking...';

	try {
		const body = 'user=' + encodeURIComponent(u) + '&pass=' + encodeURIComponent(p);
		const res = await fetch('/login', {
			method: 'POST',
			headers: {'Content-Type': 'application/x-www-form-urlencoded'},
			body
		});
		const data = await res.json();
		if (data.ok) {
			msg.textContent = 'Login successful. Redirecting...';
			msg.classList.add('ok');
			setTimeout(() => { window.location.href = '/'; }, 600);
			} else {
			msg.textContent = data.error || 'Invalid username or password.';
			msg.classList.add('err');
		}
		} catch (err) {
		msg.textContent = 'Login error: ' + err.message;
		msg.classList.add('err');
		} finally {
		btn.disabled = false;
		btn.innerHTML = originalHtml;
	}
});
</script>
</body>
</html>
)rawliteral";

const char INDEX_HTML_A[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>STM32 FOTA Control Panel</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<style>
:root {
	--primary: #2c3e50;
	--secondary: #3498db;
	--accent: #2ecc71;
	--danger: #e74c3c;
	--warning: #f39c12;
	--light: #ecf0f1;
	--dark: #2c3e50;
	--card-bg: #ffffff;
	--shadow: rgba(0, 0, 0, 0.08);
}

* {
	margin: 0;
	padding: 0;
	box-sizing: border-box;
}

body {
	font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
	background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
	color: #333;
	line-height: 1.6;
	min-height: 100vh;
	padding: 20px;
}

.container {
	max-width: 1000px;
	margin: 0 auto;
}

header {
	background: var(--card-bg);
	border-radius: 15px;
	padding: 25px 30px;
	margin-bottom: 25px;
	box-shadow: 0 10px 30px var(--shadow);
	border-left: 5px solid var(--secondary);
}

h1 {
	color: var(--primary);
	font-size: 28px;
	margin-bottom: 8px;
	display: flex;
	align-items: center;
	gap: 12px;
}

h1 i {
	color: var(--secondary);
}

.subtitle {
	color: #666;
	font-size: 16px;
	margin-bottom: 15px;
}

.header-row {
	display: flex;
	flex-wrap: wrap;
	align-items: center;
	justify-content: space-between;
	gap: 12px;
}

.header-actions {
	display: flex;
	gap: 8px;
	align-items: center;
	flex-wrap: wrap;
}

.info-box {
	background: #f8f9fa;
	border-radius: 10px;
	padding: 15px;
	margin-top: 15px;
	border-left: 4px solid var(--warning);
}

.target-info {
	font-size: 14px;
	color: #444;
	margin-top: 8px;
}

