DavidSAlexander/STM32RomWebFlasher/STM32RomWebFlasher/src/STM32WebPages.cpp
.target-info span {
	font-weight: 600;
	color: var(--secondary);
}

.card {
	background: var(--card-bg);
	border-radius: 15px;
	padding: 25px;
	margin-bottom: 25px;
	box-shadow: 0 8px 25px var(--shadow);
	transition: transform 0.3s ease, box-shadow 0.3s ease;
}

.card:hover {
	transform: translateY(-5px);
	box-shadow: 0 15px 35px rgba(0, 0, 0, 0.1);
}

.card-title {
	color: var(--primary);
	font-size: 20px;
	margin-bottom: 20px;
	display: flex;
	align-items: center;
	gap: 10px;
}

.card-title i {
	color: var(--secondary);
}

.upload-area {
	border: 3px dashed #ddd;
	border-radius: 10px;
	padding: 40px 20px;
	text-align: center;
	margin-bottom: 20px;
	transition: all 0.3s;
	background: #fafafa;
}

.upload-area:hover, .upload-area.dragover {
	border-color: var(--secondary);
	background: #f0f8ff;
}

.upload-icon {
	font-size: 48px;
	color: var(--secondary);
	margin-bottom: 15px;
}

.file-input-wrapper {
	position: relative;
	display: inline-block;
	margin-top: 15px;
}

.file-input-wrapper input[type="file"] {
	position: absolute;
	left: 0;
	top: 0;
	opacity: 0;
	width: 100%;
	height: 100%;
	cursor: pointer;
}

.file-btn {
	background: var(--secondary);
	color: white;
	border: none;
	padding: 12px 25px;
	border-radius: 8px;
	font-weight: 600;
	cursor: pointer;
	display: inline-flex;
	align-items: center;
	gap: 8px;
	transition: all 0.3s;
}

.file-btn:hover {
	background: #2980b9;
	transform: scale(1.05);
}

.btn {
	padding: 10px 18px;
	border: none;
	border-radius: 10px;
	font-weight: 600;
	cursor: pointer;
	transition: all 0.3s;
	display: inline-flex;
	align-items: center;
	justify-content: center;
	gap: 8px;
	font-size: 14px;
}

.btn-primary {
	background: var(--secondary);
	color: white;
}

.btn-primary:hover {
	background: #2980b9;
	transform: translateY(-2px);
	box-shadow: 0 4px 12px rgba(52, 152, 219, 0.3);
}

.btn-danger {
	background: var(--danger);
	color: white;
}

.btn-danger:hover {
	background: #c0392b;
	transform: translateY(-2px);
	box-shadow: 0 4px 12px rgba(231, 76, 60, 0.3);
}

.btn-success {
	background: var(--accent);
	color: white;
}

.btn-success:hover {
	background: #27ae60;
	transform: translateY(-2px);
	box-shadow: 0 4px 12px rgba(46, 204, 113, 0.3);
}

.btn-warning {
	background: var(--warning);
	color: white;
}

.btn-warning:hover {
	background: #e67e22;
	transform: translateY(-2px);
	box-shadow: 0 4px 12px rgba(243, 156, 18, 0.3);
}

.btn-info {
	background: #9b59b6;
	color: white;
}

.btn-info:hover {
	background: #8e44ad;
	transform: translateY(-2px);
	box-shadow: 0 4px 12px rgba(155, 89, 182, 0.3);
}

.btn:disabled {
	opacity: 0.6;
	cursor: not-allowed;
	transform: none !important;
	box-shadow: none !important;
}

.button-grid {
	display: grid;
	grid-template-columns: repeat(auto-fill, minmax(220px, 1fr));
	gap: 15px;
	margin-top: 10px;
}

.log-container {
	background: #1a1a1a;
	border-radius: 10px;
	padding: 20px;
	margin-top: 10px;
	overflow: hidden;
}

#log {
	background: #1a1a1a;
	color: #00ff00;
	font-family: 'Consolas', 'Monaco', monospace;
	min-height: 200px;
	max-height: 400px;
	overflow-y: auto;
	padding: 15px;
	border-radius: 8px;
	white-space: pre-wrap;
	word-break: break-all;
	font-size: 14px;
	border: 1px solid #333;
}

.log-header {
	display: flex;
	justify-content: space-between;
	align-items: center;
	margin-bottom: 15px;
}

.log-controls button {
	background: #444;
	color: white;
	border: none;
	padding: 6px 12px;
	border-radius: 5px;
	font-size: 13px;
	cursor: pointer;
	margin-left: 8px;
}

.log-entry {
	padding: 5px 0;
	border-bottom: 1px solid #2a2a2a;
}

.log-time {
	color: #888;
}

.log-cmd {
	color: #3498db;
	font-weight: bold;
}

.log-response {
	color: #2ecc71;
}

.log-error {
	color: #e74c3c;
}

.status-indicator {
	display: inline-flex;
	align-items: center;
	gap: 8px;
	padding: 6px 12px;
	border-radius: 20px;
	background: #f0f0f0;
	font-size: 13px;
}

.status-dot {
	width: 10px;
	height: 10px;
	border-radius: 50%;
	background: #95a5a6;
}

.status-dot.active {
	background: var(--accent);
	animation: pulse 1.5s infinite;
}

@keyframes pulse {
	0% { opacity: 1; }
	50% { opacity: 0.5; }
	100% { opacity: 1; }
}

.progress-container {
	margin-top: 15px;
	display: none;
}

.progress-bar {
	height: 10px;
	background: #eee;
	border-radius: 5px;
	overflow: hidden;
	margin-top: 10px;
}

.progress-fill {
	height: 100%;
	background: linear-gradient(90deg, var(--secondary), var(--accent));
	width: 0%;
	transition: width 0.3s;
}

.legend-wrapper {
	margin-top: 18px;
	font-size: 13px;
	color: #666;
}

.legend-badge {
	display: inline-block;
	padding: 4px 10px;
	border-radius: 12px;
	margin-right: 8px;
	font-size: 12px;
	font-weight: 600;
	cursor: default;
}

.legend-full     { background: rgba(46, 204, 113, 0.12); color: #27ae60; }
.legend-destr    { background: rgba(243, 156, 18, 0.12); color: #e67e22; }
.legend-prog     { background: rgba(52, 152, 219, 0.12); color: #2980b9; }
.legend-info     { background: rgba(155, 89, 182, 0.12); color: #8e44ad; }

.footer {
	text-align: center;
	margin-top: 30px;
	color: rgba(255, 255, 255, 0.7);
	font-size: 14px;
}

@media (max-width: 768px) {
	.card {
		padding: 20px;
	}
	h1 {
		font-size: 24px;
	}
	.header-row {
		flex-direction: column;
		align-items: flex-start;
		gap: 10px;
	}
	.header-actions {
		width: 100%;
		justify-content: flex-start;
	}
}
</style>
</head>
<body>
<div class="container">
<header>
<h1><i class="fas fa-microchip"></i> STM32 FOTA Control Panel</h1>
<p class="subtitle">ESP8266-based Firmware Update System using STM32 ROM Bootloader</p>

<div class="header-row">
<div>
<div class="target-info">
<strong>Target:</strong> <span id="targetInfo">Not connected</span>
</div>
<div class="status-indicator" style="margin-top: 10px;">
<div class="status-dot active"></div>
<span>ESP8266 Online</span>
</div>
</div>

<div class="header-actions">
<button id="connectBtn" class="btn btn-primary">
<i class="fas fa-plug"></i> Connect Target
</button>
<button id="logoutBtn" class="btn" style="background:#7f8c8d;color:#fff;">
<i class="fas fa-sign-out-alt"></i> Logout
</button>
</div>
</div>

<div class="info-box">
<p><strong>Workflow:</strong> Connect target → Upload <code>update.bin</code> → Run bootloader commands.</p>
<p><strong>Current file:</strong> <span id="currentFile">None</span></p>
</div>
</header>

<div class="card" id="uploadCard" style="display:none;">
<h2 class="card-title"><i class="fas fa-upload"></i> 1. Upload Firmware</h2>
<p>Select a binary (.bin) file to upload to ESP8266 filesystem (saved as /update.bin)</p>

<div class="upload-area" id="dropArea">
<div class="upload-icon">
<i class="fas fa-cloud-upload-alt"></i>
</div>
<p><strong>Drag & drop your firmware file here</strong></p>
<p>or</p>
<div class="file-input-wrapper">
<button class="file-btn">
<i class="fas fa-folder-open"></i> Browse Files
</button>
<form id="uploadForm" method="POST" action="/upload" enctype="multipart/form-data">
<input type="file" name="firmware" id="fwFile" accept=".bin" required>
</form>
</div>
<p class="file-hint">Maximum file size limited by ESP8266 FS (LittleFS).</p>
</div>

<div class="progress-container" id="progressContainer">
<div>Uploading: <span id="progressText">0%</span></div>
<div class="progress-bar">
<div class="progress-fill" id="progressFill"></div>
</div>
</div>

<div id="uploadStatus" style="margin-top: 15px; font-weight: 600;"></div>

<button id="uploadBtn" class="btn btn-primary" style="margin-top: 15px; width: 100%;">
<i class="fas fa-upload"></i> Upload Firmware
</button>
</div>

<div class="card" id="cmdCard" style="display:none;">
<h2 class="card-title"><i class="fas fa-terminal"></i> 2. Bootloader Commands</h2>
<p>Control the STM32 built-in ROM bootloader via ESP8266</p>

<div class="button-grid">
<button class="btn btn-success" data-cmd="S">
<i class="fas fa-play-circle"></i> Full Update
</button>

<button class="btn btn-warning" data-cmd="E">
<i class="fas fa-eraser"></i> Erase Only
</button>

<button class="btn btn-primary" data-cmd="U">
<i class="fas fa-code"></i> Program Only
</button>

<button class="btn btn-info" data-cmd="J">
<i class="fas fa-redo"></i> Reset to App
</button>

<button class="btn btn-info" data-cmd="G">
<i class="fas fa-id-card"></i> Read Chip ID
</button>

<button class="btn btn-info" data-cmd="R">
<i class="fas fa-info-circle"></i> Bootloader Version
</button>

<button class="btn btn-info" data-cmd="C">
<i class="fas fa-list"></i> Get Commands
</button>

