DavidSAlexander/STM32RomWebFlasher/STM32RomWebFlasher/src/STM32WebPages.cpp
<button class="btn btn-danger" data-cmd="T">
<i class="fas fa-vial"></i> Test RAM Write
</button>
</div>

<div class="legend-wrapper">
<strong>Legend:</strong>
<span class="legend-badge legend-full">Full Process</span>
<span class="legend-badge legend-destr">Destructive</span>
<span class="legend-badge legend-prog">Programming</span>
<span class="legend-badge legend-info">Info / Utility</span>
</div>
</div>

<div class="card">
<div class="log-header">
<h2 class="card-title"><i class="fas fa-list-alt"></i> Command Log</h2>
<div class="log-controls">
<button onclick="clearLog()"><i class="fas fa-trash"></i> Clear</button>
<button onclick="toggleAutoScroll()" id="scrollToggle"><i class="fas fa-arrow-down"></i> Auto-scroll ON</button>
</div>
</div>

<div class="log-container">
<div id="log"></div>
</div>

<div style="margin-top: 15px; display: flex; gap: 10px; flex-wrap: wrap;">
<button class="btn" onclick="exportLog()" style="background: #7f8c8d; color: white;">
<i class="fas fa-download"></i> Export Log
</button>
</div>
</div>

<div class="footer">
<p>STM32 FOTA Panel | ESP8266 Web Interface | ROM Bootloader</p>
<p>Access via mDNS: <code>http://)rawliteral";

const char INDEX_HTML_B[] PROGMEM = R"rawliteral(.local/</code></p>
<p>By David S. Alexander</p>
</div>
</div>

<script>
const logDiv = document.getElementById('log');
const uploadBtn = document.getElementById('uploadBtn');
const uploadForm = document.getElementById('uploadForm');
const fwFileInput = document.getElementById('fwFile');
const uploadStatus = document.getElementById('uploadStatus');
const dropArea = document.getElementById('dropArea');
const progressContainer = document.getElementById('progressContainer');
const progressFill = document.getElementById('progressFill');
const progressText = document.getElementById('progressText');
const currentFileSpan = document.getElementById('currentFile');
const connectBtn = document.getElementById('connectBtn');
const logoutBtn = document.getElementById('logoutBtn');
const targetInfoSpan = document.getElementById('targetInfo');
const uploadCard = document.getElementById('uploadCard');
const cmdCard = document.getElementById('cmdCard');
let autoScroll = true;
let isConnected = false;

addLog('System initialized. Ready for connect.', 'system');

['dragenter', 'dragover', 'dragleave', 'drop'].forEach(eventName => {
	dropArea.addEventListener(eventName, e => {
		e.preventDefault();
		e.stopPropagation();
	}, false);
});

['dragenter', 'dragover'].forEach(eventName => {
	dropArea.addEventListener(eventName, () => dropArea.classList.add('dragover'), false);
});

['dragleave', 'drop'].forEach(eventName => {
	dropArea.addEventListener(eventName, () => dropArea.classList.remove('dragover'), false);
});

dropArea.addEventListener('drop', e => {
	const dt = e.dataTransfer;
	const files = dt.files;
	if (files.length) {
		fwFileInput.files = files;
		updateFileInfo(files[0]);
		showUploadStatus('File selected: ' + files[0].name, 'info');
	}
}, false);

fwFileInput.addEventListener('change', function() {
	if (this.files.length) updateFileInfo(this.files[0]);
});

function updateFileInfo(file) {
	currentFileSpan.textContent = file.name + ' (' + formatFileSize(file.size) + ')';
	currentFileSpan.style.color = '#2ecc71';
	currentFileSpan.style.fontWeight = 'bold';
}

function formatFileSize(bytes) {
	if (bytes === 0) return '0 Bytes';
	const k = 1024;
	const sizes = ['Bytes', 'KB', 'MB', 'GB'];
	const i = Math.floor(Math.log(bytes) / Math.log(k));
	return parseFloat((bytes / Math.pow(k, i)).toFixed(2)) + ' ' + sizes[i];
}

uploadBtn.addEventListener('click', function() {
	if (!isConnected) {
		showUploadStatus('Connect target first.', 'error');
		return;
	}
	if (!fwFileInput.files.length) {
		showUploadStatus('Please select a firmware file first.', 'error');
		return;
	}
	const file = fwFileInput.files[0];
	if (!file.name.endsWith('.bin')) {
		showUploadStatus('Please select a .bin file.', 'error');
		return;
	}
	uploadFile(file);
});

function uploadFile(file) {
	const formData = new FormData();
	formData.append('firmware', file);

	uploadBtn.disabled = true;
	uploadBtn.innerHTML = '<i class="fas fa-spinner fa-spin"></i> Uploading...';
	progressContainer.style.display = 'block';
	progressFill.style.width = '0%';
	progressText.textContent = '0%';

	const xhr = new XMLHttpRequest();

	xhr.upload.addEventListener('progress', function(e) {
		if (e.lengthComputable) {
			const percentComplete = (e.loaded / e.total) * 100;
			progressFill.style.width = percentComplete + '%';
			progressText.textContent = Math.round(percentComplete) + '%';
		}
	});

	xhr.addEventListener('load', function() {
		uploadBtn.disabled = false;
		uploadBtn.innerHTML = '<i class="fas fa-upload"></i> Upload Firmware';

		if (xhr.status === 200) {
			showUploadStatus('Upload successful: ' + xhr.responseText, 'success');
			addLog('Firmware uploaded: ' + file.name + ' (' + formatFileSize(file.size) + ')', 'upload');
			} else {
			showUploadStatus('Upload failed: ' + xhr.statusText, 'error');
		}

		setTimeout(() => { progressContainer.style.display = 'none'; }, 2000);
	});

	xhr.addEventListener('error', function() {
		uploadBtn.disabled = false;
		uploadBtn.innerHTML = '<i class="fas fa-upload"></i> Upload Firmware';
		showUploadStatus('Upload error. Check connection.', 'error');
		progressContainer.style.display = 'none';
	});

	xhr.open('POST', '/upload');
	xhr.send(formData);
}

function showUploadStatus(message, type) {
	uploadStatus.textContent = message;
	uploadStatus.style.color =
	type === 'success' ? '#2ecc71' :
	type === 'error'   ? '#e74c3c' :
	type === 'info'    ? '#3498db' : '#333';
}

connectBtn.addEventListener('click', async () => {
	connectBtn.disabled = true;
	try {
		if (!isConnected) {
			connectBtn.innerHTML = '<i class="fas fa-spinner fa-spin"></i> Connecting...';
			const res = await fetch('/connect', { method: 'POST' });
			const data = await res.json();
			if (data.ok) {
				addLog('Connected: ' + (data.desc || ''), 'response');
				} else {
				alert('Connect failed: ' + (data.error || 'unknown error'));
			}
			await refreshStatus();
			} else {
			connectBtn.innerHTML = '<i class="fas fa-spinner fa-spin"></i> Disconnecting...';
			const res = await fetch('/disconnect', { method: 'POST' });
			await res.json().catch(() => {});
			addLog('Target disconnected', 'system');
			await refreshStatus();
		}
		} catch (err) {
		alert('Connect/disconnect error: ' + err.message);
		} finally {
		connectBtn.disabled = false;
	}
});

logoutBtn.addEventListener('click', async () => {
	if (!confirm('Logout and require login again on all devices?')) return;
	logoutBtn.disabled = true;
	const original = logoutBtn.innerHTML;
	logoutBtn.innerHTML = '<i class="fas fa-spinner fa-spin"></i> Logging out...';
	try {
		const res = await fetch('/logout', { method: 'POST' });
		await res.json().catch(() => {});
		window.location.href = '/';
		} catch (err) {
		alert('Logout failed: ' + err.message);
		logoutBtn.disabled = false;
		logoutBtn.innerHTML = original;
	}
});

