DavidSAlexander/STM32RomWebFlasher/STM32RomWebFlasher/src/STM32WebPages.cpp
async function refreshStatus() {
	try {
		const res = await fetch('/status');
		if (!res.ok) return;
		const data = await res.json();
		updateUiForStatus(data);
		} catch (e) {}
	}

	function updateUiForStatus(status) {
		isConnected = !!status.connected;

		if (isConnected) {
			connectBtn.innerHTML = '<i class="fas fa-unlink"></i> Disconnect Target';
			connectBtn.classList.remove('btn-primary');
			connectBtn.classList.add('btn-danger');
			targetInfoSpan.textContent = status.desc || 'Target connected';
			uploadCard.style.display = 'block';
			cmdCard.style.display = 'block';
			} else {
			connectBtn.innerHTML = '<i class="fas fa-plug"></i> Connect Target';
			connectBtn.classList.remove('btn-danger');
			connectBtn.classList.add('btn-primary');
			targetInfoSpan.textContent = 'Not connected';
			uploadCard.style.display = 'none';
			cmdCard.style.display = 'none';
		}

		if (status.hasFile && status.connected) {
			currentFileSpan.textContent = 'update.bin on device (Flash ' + status.flashKB + ' KB, devID 0x0' +
			status.devId.toString(16) + ')';
			currentFileSpan.style.color = '#2ecc71';
			} else if (status.hasFile) {
			currentFileSpan.textContent = 'update.bin on device (connect target to use)';
			currentFileSpan.style.color = '#3498db';
			} else {
			currentFileSpan.textContent = 'None';
			currentFileSpan.style.color = '#444';
		}
	}

	document.querySelectorAll('#cmdCard .btn').forEach(btn => {
		const cmd = btn.getAttribute('data-cmd');
		if (!cmd) return;
		btn.addEventListener('click', () => sendCmd(cmd, btn));
	});

	async function sendCmd(cmd, button) {
		if (!isConnected) {
			addLog('Target not connected. Connect first.', 'error');
			alert('Connect target first.');
			return;
		}

		const cmdNames =
		{
			'S': 'Full Update',
			'E': 'Erase Only',
			'U': 'Program Only',
			'J': 'Jump to Application',
			'G': 'Read Chip ID',
			'R': 'Read Bootloader Version',
			'C': 'Get Supported Commands',
			'T': 'Test RAM Write'
		};

		addLog('Sending: ' + (cmdNames[cmd] || cmd), 'cmd');

		const originalText = button.innerHTML;
		button.disabled = true;
		button.innerHTML = '<i class="fas fa-spinner fa-spin"></i> Processing...';

		try {
			const response = await fetch('/cmd?c=' + encodeURIComponent(cmd));
			const text = await response.text();
			addLog('Response: ' + text, 'response');
			} catch (err) {
			addLog('Error: ' + err.message, 'error');
			} finally {
			button.disabled = false;
			button.innerHTML = originalText;
		}
	}

	function addLog(message, type = 'info') {
		const now = new Date();
		const timeString = now.toLocaleTimeString([], {hour: '2-digit', minute:'2-digit', second:'2-digit'});
		const typeClass = type === 'cmd' ? 'log-cmd' :
		type === 'response' ? 'log-response' :
		type === 'error' ? 'log-error' : '';

		const logEntry = document.createElement('div');
		logEntry.className = 'log-entry';
		logEntry.innerHTML = `<span class="log-time">[${timeString}]</span> <span class="${typeClass}">${message}</span>`;
		logDiv.prepend(logEntry);

		if (logDiv.children.length > 200) {
			logDiv.removeChild(logDiv.lastChild);
		}

		if (autoScroll && logDiv.firstChild) {
			logDiv.scrollTop = 0;
		}
	}

	function clearLog() {
		logDiv.innerHTML = '';
		addLog('Log cleared', 'system');
	}

	function toggleAutoScroll() {
		autoScroll = !autoScroll;
		const toggleBtn = document.getElementById('scrollToggle');
		if (autoScroll) {
			toggleBtn.innerHTML = '<i class="fas fa-arrow-down"></i> Auto-scroll ON';
			toggleBtn.style.background = '#2ecc71';
			} else {
			toggleBtn.innerHTML = '<i class="fas fa-times"></i> Auto-scroll OFF';
			toggleBtn.style.background = '#e74c3c';
		}
	}

	function exportLog() {
		const logContent = Array.from(logDiv.children)
		.map(entry => entry.textContent)
		.reverse()
		.join('\n');

		const blob = new Blob([logContent], {type: 'text/plain'});
		const url = URL.createObjectURL(blob);
		const a = document.createElement('a');
		a.href = url;
		a.download = `fota-log-${new Date().toISOString().slice(0,10)}.txt`;
		document.body.appendChild(a);
		a.click();
		document.body.removeChild(a);
		URL.revokeObjectURL(url);

		addLog('Log exported', 'system');
	}

	document.addEventListener('DOMContentLoaded', () => {
		refreshStatus();
	});
	</script>
	</body>
	</html>
	)rawliteral";
